import Container from "../../components/modules/Container/Container";
const About = () => {
  return (
    <Container>
      <div className="flex flex-col items-center px-12 pt-14 max-sm:px-5 max-sm:pt-1 sm:!mb-44 lg:!flex-row lg:!px-28">
        <video
          src="/images/Xw55QrN0QJMO0R25p1.mp4"
          loop
          autoPlay
          className="w-3/4 md:!w-1/2"
        ></video>
        <div className="text-right sm:text-base text-sm space-y-6" dir="rtl">
          <p>
            <span className="sm:text-xl text-base">من علی موید هستم، <span className="text-main">متخصص تغذیه و سبک زندگی</span> با بیش از ۲۵ سال تجربه در
            ونکوور کانادا. </span> 
              از همان ابتدای کارم، باور داشتم که هر فرد می‌تواند به
            بهترین نسخه از خود تبدیل شود؛ کافی است ابزارهای مناسب و راهنمایی
            درست در اختیار داشته باشد.  
          </p>
          <p>مدرک لیسانس تغذیه خود را از دانشگاه شهید
            بهشتی ایران گرفتم و پس از مهاجرت به کانادا، مدرک Certified Sport
            Performance Nutritionist را دریافت کردم. در طول سال‌ها، تجربه‌ام در
            بخش‌های مختلف از جمله بیمارستان‌های معتبر ایران و موسسه استاندارد، و
            همچنین برگزاری سمینارهای بین‌المللی در زمینه آب، سلامت و زیبایی، به
            من آموخت که سلامتی چیزی فراتر از یک رژیم غذایی است. ترکیب علم تغذیه،
            ورزش، استراحت کافی و توجه به روح و روان، <span className="border-b border-main pb-1"> کلید دستیابی به یک زندگی
            متعادل و سالم است</span>.   
            </p>
            <p>   هدف من این است که به شما کمک کنم تا با برنامه‌های
            تغذیه‌ای و ورزشی شخصی‌سازی شده، به اهداف سلامتی خود برسید. در این
            مسیر، ابزارهای هوشمند، محاسبه‌گرهای کالری، و برنامه‌های ۲۱ روزه ما
            برای ایجاد عادات سالم و پایدار، همراه شما خواهند بود. اعتقاد من به
            طب کل‌نگر است، جایی که جسم، ذهن و روح در کنار هم بهبود می‌یابند. به
            من بپیوندید و با هم مسیر دستیابی به سلامتی و زیبایی را طی کنیم. شما
            شایسته بهترین‌ها هستید، و من اینجا هستم تا به شما کمک کنم به آن دست
            یابید.</p>
        </div>
      </div>
    </Container>
  );
};

export default About;
