 
import Title from "../../../../components/modules/Title/Title";
import { Button } from "../../../../components/shadcn/ui/button";
// import Modal from "../../../../components/templates/UserPanel/Health/Diets/Modal";
import Layout from "../../../../Layouts/UserLayouts";

const Challenge = () => {
  return (
    <Layout>
      <div className="flex flex-col items-center justify-between gap-4 sm:flex-row sm:gap-0">
        <Title title="چالش شماره سوم" /> 
          <div className="relative z-50 flex gap-3">
      <Button variant={'main'}>شروع چالش</Button>
      <Button disabled variant={"default"}>اتمام چالش</Button>
          </div> 
      </div>
      <main data-aos="fade-up">
        <video
          src="/images/5NJy1lvx8cz37xS05B.mp4"
          loop
          autoPlay
          className="mx-auto w-[400px]"
        ></video>
        <p className="leading-8">
          رژیم قلیایی با هدف ایجاد تعادل در pH بدن و بهبود سلامت عمومی طراحی شده
          است. این رژیم بر مصرف غذاهای قلیایی مانند میوه‌ها، سبزیجات و دانه‌ها
          تأکید دارد و مصرف غذاهای اسیدی مانند گوشت قرمز، محصولات لبنی و شکر را
          کاهش می‌دهد. رژیم قلیایی به کاهش التهابات، بهبود سطح انرژی و ارتقاء
          سلامت پوست و گوارش کمک می‌کند. با دنبال کردن این رژیم، احساس سبکی و
          شادابی بیشتری خواهید داشت و بدن شما به‌طور طبیعی به تعادل می‌رسد. این
          رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال بهبود سطح انرژی، کاهش
          التهابات و تقویت سلامت عمومی بدن هستند. چه کسانی نباید از این رژیم
          استفاده کنند؟ افرادی که نیاز به مصرف بالای پروتئین دارند یا به
          رژیم‌های خاص مانند کتو متعهد هستند، ممکن است این رژیم برایشان مناسب
          نباشد.
        </p>
        <p className="leading-8">
          رژیم قلیایی با هدف ایجاد تعادل در pH بدن و بهبود سلامت عمومی طراحی شده
          است. این رژیم بر مصرف غذاهای قلیایی مانند میوه‌ها، سبزیجات و دانه‌ها
          تأکید دارد و مصرف غذاهای اسیدی مانند گوشت قرمز، محصولات لبنی و شکر را
          کاهش می‌دهد. رژیم قلیایی به کاهش التهابات، بهبود سطح انرژی و ارتقاء
          سلامت پوست و گوارش کمک می‌کند. با دنبال کردن این رژیم، احساس سبکی و
          شادابی بیشتری خواهید داشت و بدن شما به‌طور طبیعی به تعادل می‌رسد. این
          رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال بهبود سطح انرژی، کاهش
          التهابات و تقویت سلامت عمومی بدن هستند. چه کسانی نباید از این رژیم
          استفاده کنند؟ افرادی که نیاز به مصرف بالای پروتئین دارند یا به
          رژیم‌های خاص مانند کتو متعهد هستند، ممکن است این رژیم برایشان مناسب
          نباشد.
        </p>
        <p className="leading-8">
          رژیم قلیایی با هدف ایجاد تعادل در pH بدن و بهبود سلامت عمومی طراحی شده
          است. این رژیم بر مصرف غذاهای قلیایی مانند میوه‌ها، سبزیجات و دانه‌ها
          تأکید دارد و مصرف غذاهای اسیدی مانند گوشت قرمز، محصولات لبنی و شکر را
          کاهش می‌دهد. رژیم قلیایی به کاهش التهابات، بهبود سطح انرژی و ارتقاء
          سلامت پوست و گوارش کمک می‌کند. با دنبال کردن این رژیم، احساس سبکی و
          شادابی بیشتری خواهید داشت و بدن شما به‌طور طبیعی به تعادل می‌رسد. این
          رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال بهبود سطح انرژی، کاهش
          التهابات و تقویت سلامت عمومی بدن هستند. چه کسانی نباید از این رژیم
          استفاده کنند؟ افرادی که نیاز به مصرف بالای پروتئین دارند یا به
          رژیم‌های خاص مانند کتو متعهد هستند، ممکن است این رژیم برایشان مناسب
          نباشد.
        </p>
      </main>
    </Layout>
  );
};

export default Challenge;
