const diets: { title: string; text: string; image: string; id: number }[] = [
  {
    title: " رژیم غذایی متعادل کاهش وزن",
    text: `رژیم غذایی متعادل کاهش وزن، بر اساس 
    اصول تعادل میان گروه‌های غذایی مختلف و دریافت کالری مناسب طراحی شده است. با این رژیم، شما به طور سالم و پایدار وزن کم می‌کنید بدون اینکه بدن‌تان از مواد مغذی حیاتی محروم شود. هر وعده غذایی سرشار از ویتامین‌ها، پروتئین‌ها، و کربوهیدرات‌های پیچیده است تا انرژی لازم برای روزتان را تأمین کند. این رژیم به شما کمک می‌کند به آرامی و بدون احساس گرسنگی به وزن ایده‌آل خود برسید.
    این رژیم برای افرادی که به دنبال کاهش وزن با حفظ سلامتی و انرژی هستند، مناسب است.
    برای افراد با مشکلات شدید گوارشی یا نیازهای تغذیه‌ای خاص توصیه نمی‌شود.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 1,
  },
  {
    title: "رژیم غذاهای ایرانی",
    text: `رژیم غذایی ایرانی، لذت کاهش وزن را با طعم‌های بی‌نظیر سنتی تجربه کنید! این رژیم بر اساس غذاهای اصیل ایرانی مانند خورش‌ها، کباب‌ها و سالادهای محلی تنظیم شده است که هم سالم هستند و هم سرشار از مواد مغذی. بدون نیاز به تغییرات شدید در عادات غذایی، می‌توانید به تناسب اندام دلخواه خود برسید و از وعده‌های غذایی مورد علاقه‌تان لذت ببرید. کاهش وزن همراه با حس خوب از غذاهای خوشمزه ایرانی ممکن است!
    این رژیم برای افرادی که به دنبال کاهش وزن با استفاده از غذاهای سنتی و خانگی هستند، مناسب است.
    برای کسانی که به دنبال رژیم‌های خاص مانند وگان یا فاقد گلوتن هستند، مناسب نیست.`,
    image: "/images/11663519_20944480.svg",
    id: 2,
  },
  {
    title: "رژیم کتوژنیک ( کتو)",
    text: `رژیم کتوژنیک یک روش بی‌نظیر برای سوزاندن چربی‌ها و رسیدن به وزن دلخواه است! در این رژیم، با کاهش مصرف کربوهیدرات‌ها و افزایش چربی‌های سالم، بدن وارد حالت "کتوز" می‌شود، که چربی‌ها را به جای قندها برای تأمین انرژی می‌سوزاند. با رژیم کتو، می‌توانید با وعده‌های غذایی مغذی و متنوع، به سرعت وزن کم کنید و احساس سیری بیشتری داشته باشید.
    این رژیم برای افرادی که به دنبال کاهش وزن سریع و مدیریت قند خون هستند، مناسب است.
    برای افرادی که مشکلات کلیوی یا کبدی دارند یا به دنبال رژیم غذایی با کربوهیدرات‌های بیشتر هستند، مناسب نیست.`,
    image: "/images/7434479_3665593.svg",
    id: 3,
  },
  {
    title: "رژیم فستینگ",
    text: `رژیم فستینگ یک روش ساده و مؤثر برای کاهش وزن است که به بدن شما فرصت استراحت و ترمیم می‌دهد. با تعیین بازه‌های زمانی مشخص برای خوردن و روزه‌داری، این رژیم باعث افزایش سوخت‌وساز، تنظیم قند خون و سوزاندن سریع‌تر چربی‌ها می‌شود. بدون محدودیت سخت در نوع غذا، می‌توانید از وعده‌های دلخواه لذت ببرید و همچنان وزن خود را کاهش دهید.
    این رژیم برای افرادی که به دنبال کاهش وزن و بهبود سلامت متابولیک با تنظیم زمان غذا خوردن هستند، مناسب است.
    برای افراد مبتلا به دیابت نوع ۱ یا کسانی که نیاز به تغذیه مداوم دارند، مناسب نیست.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 4,
  },
  {
    title: "رژیم مدیترانه ای",
    text: `رژیم مدیترانه‌ای یکی از سالم‌ترین و خوشمزه‌ترین روش‌های کاهش وزن است که الهام‌گرفته از غذاهای سنتی کشورهای مدیترانه‌ای مانند ایتالیا و یونان است. این رژیم با تمرکز بر مصرف سبزیجات، میوه‌ها، غلات کامل، ماهی و روغن زیتون به بهبود سلامت قلب و کاهش وزن کمک می‌کند. با پیروی از این رژیم، هم از طعم لذیذ غذاها لذت می‌برید و هم به آرامی به تناسب اندام خود دست می‌یابید. این رژیم برای افرادی که به دنبال تغذیه سالم با تمرکز بر غذاهای تازه و طبیعی هستند، مناسب است.
    برای کسانی که رژیم‌های پرپروتئین یا بسیار کم‌چرب را ترجیح می‌دهند، مناسب نیست.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 5,
  },
  {
    title: "رژیم پالئو",
    text: `رژیم پالئو، بازگشتی به تغذیه اجداد ما! این رژیم با تمرکز بر مواد غذایی طبیعی و غیر فرآوری شده مانند گوشت، ماهی، میوه‌ها و سبزیجات، به شما کمک می‌کند تا بدن‌تان را از مواد مصنوعی پاکسازی کرده و به وزن ایده‌آل برسید. پالئو علاوه بر کاهش وزن، انرژی و سلامتی شما را نیز بهبود می‌بخشد، زیرا مواد مغذی کامل و بدون افزودنی‌ها را به بدن شما می‌رساند.
    این رژیم برای افرادی که به دنبال تغذیه‌ای طبیعی و بدون فرآورده‌های صنعتی هستند، مناسب است.
    برای کسانی که به دنبال رژیم‌های گیاهی یا با کربوهیدرات بالا هستند، مناسب نیست.`,
    image: "/images/8381144_3901686.svg",
    id: 6,
  },
  {
    title: "رژیم وگان",
    text: `رژیم وگان یک سبک زندگی سالم و دوستدار محیط زیست است که کاملاً بر پایه غذاهای گیاهی طراحی شده است. با حذف محصولات حیوانی، این رژیم به شما کمک می‌کند تا با مصرف میوه‌ها، سبزیجات، غلات و حبوبات به وزن دلخواه خود برسید و انرژی بیشتری احساس کنید. رژیم وگان نه‌تنها برای کاهش وزن مفید است، بلکه سلامت قلب و کاهش خطر بیماری‌های مزمن را نیز بهبود می‌بخشد.
    این رژیم برای افرادی که به دنبال سبک زندگی سالم، اخلاقی و بدون محصولات حیوانی هستند، مناسب است.
    برای کسانی که نیاز به پروتئین‌های حیوانی دارند یا به برخی مواد مغذی حیوانی وابسته هستند، مناسب نیست.`,
    image: "/images/11663519_20944480.svg",
    id: 7,
  },
  {
    title: "رژیم گیاه خواری",
    text: `رژیم گیاه‌خواری با حذف گوشت و ماهی و تمرکز بر مصرف غذاهای گیاهی، به شما کمک می‌کند وزن خود را کاهش دهید و بدن خود را با مواد مغذی از جمله میوه‌ها، سبزیجات، غلات و حبوبات تغذیه کنید. این رژیم باعث افزایش انرژی و بهبود سلامت قلب می‌شود، در حالی که همچنان امکان مصرف تخم‌مرغ و لبنیات را دارد. تفاوت اصلی رژیم گیاه‌خواری با رژیم وگان در این است که گیاه‌خواران همچنان برخی از فرآورده‌های حیوانی مانند لبنیات و تخم‌مرغ را مصرف می‌کنند، در حالی که وگان‌ها از تمامی محصولات حیوانی اجتناب می‌کنند.
    این رژیم برای افرادی که به دنبال تغذیه سالم بدون مصرف گوشت هستند، مناسب است.
    برای افرادی که به پروتئین‌های حیوانی نیاز دارند یا به دنبال رژیم‌های پرپروتئین هستند، مناسب نیست.`,
    image: "/images/7434479_3665593.svg",
    id: 8,
  },
  {
    title: "رژیم خام خواری",
    text: `رژیم خام خواری، یک روش تغذیه‌ای است که بر پایه مصرف غذاهای خام و غیرپخته تأسیس شده است. این رژیم شامل میوه‌ها، سبزیجات، آجیل، دانه‌ها و غلاتی است که به صورت خام و بدون فرآیندهای حرارتی تهیه می‌شوند. طرفداران این رژیم معتقدند که حرارت باعث از بین رفتن آنزیم‌ها و مواد مغذی موجود در غذاها می‌شود و خوردن غذاهای خام می‌تواند به بهبود سلامت عمومی، افزایش انرژی و کاهش وزن کمک کند. علاوه بر این، این رژیم می‌تواند به سم‌زدایی بدن کمک کرده و خطر ابتلا به بیماری‌های مزمن را کاهش دهد.
    مناسب برای:
    افرادی که به دنبال افزایش انرژی و بهبود سیستم ایمنی خود هستند.
    کسانی که قصد دارند وزن خود را کاهش دهند و به یک رژیم غذایی سالم و طبیعی روی آورند.
    نامناسب برای:
    افرادی که دارای مشکلات گوارشی یا بیماری‌های خاصی هستند که نیاز به مصرف غذاهای پخته دارند.`,
    image: "/images/7942060_3794813.svg",
    id: 9,
  },
  {
    title: "رژیم فاقد گلوتن",
    text: `رژیم فاقد گلوتن، یک برنامه غذایی است که شامل حذف تمامی مواد غذایی حاوی گلوتن می‌شود. گلوتن پروتئینی است که در گندم، جو، و چاودار یافت می‌شود و ممکن است باعث واکنش‌های حساسیتی یا مشکلات گوارشی در برخی افراد شود. این رژیم به طور طبیعی شامل میوه‌ها، سبزیجات، پروتئین‌های بدون گلوتن مانند گوشت، ماهی، تخم‌مرغ و لبنیات، و غلاتی مانند برنج، ذرت و کینوا است. با اتخاذ این رژیم، بسیاری از افراد با مشکلات گوارشی بهبود یافته و انرژی بیشتری را تجربه می‌کنند.
    این رژیم برای: افرادی که به بیماری سلیاک مبتلا هستند یا نسبت به گلوتن حساسیت دارند.
    این رژیم مناسب نیست برای: افرادی که هیچگونه حساسیتی به گلوتن ندارند و در پی تغییرات عمده در رژیم غذایی نیستند.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 10,
  },
  {
    title: "رژیم افزایش وزن",
    text: `رژیم افزایش وزن یک برنامه غذایی است که با هدف افزایش وزن سالم و مؤثر طراحی شده است. این رژیم شامل مصرف مواد غذایی با کالری بالا، پروتئین‌های سالم، و چربی‌های مفید است تا به بدن کمک کند به تدریج وزن اضافه کند و عضلات را تقویت نماید. این رژیم می‌تواند شامل وعده‌های غذایی غنی از پروتئین، مانند گوشت، ماهی، تخم‌مرغ، لبنیات و همچنین مواد غذایی مغذی مانند مغزها، دانه‌ها، و آووکادو باشد. با پیروی از این رژیم، نه تنها وزن خود را افزایش می‌دهید، بلکه سلامت کلی خود را نیز بهبود می‌بخشید.
    این رژیم برای: افرادی که دچار کمبود وزن هستند و به دنبال افزایش وزن سالم و متناسب می‌باشند.
    این رژیم مناسب نیست برای: افرادی که به دنبال کاهش وزن یا کنترل وزن خود هستند و یا مبتلا به مشکلات سلامتی مرتبط با چاقی هستند.`,
    image: "/images/2945081_28533.svg",
    id: 11,
  },
  {
    title: "رژیم تمیز کردن بدن (Detox Diet)",
    text: `رژیم تمیز کردن بدن یا دتوکس، یک برنامه غذایی موقت است که با هدف حذف سموم و مواد زائد از بدن طراحی شده است. این رژیم معمولاً شامل مصرف مواد غذایی طبیعی و تازه، مانند میوه‌ها، سبزیجات، و آب‌های گیاهی است و از غذاهای فرآوری شده، قند و چربی‌های مضر جلوگیری می‌کند. در این رژیم، بدن به یک دوره استراحت و بازسازی می‌رسد و از طریق سم‌زدایی، انرژی بیشتری برای فعالیت‌های روزمره و حفظ سلامت کلی پیدا می‌کند. با پیروی از این رژیم، نه تنها احساس سبکی و شادابی بیشتری خواهید داشت، بلکه به بهبود عملکرد سیستم گوارش و تقویت سیستم ایمنی نیز کمک خواهید کرد.
    این رژیم برای: افرادی که به دنبال بهبود سلامت عمومی، افزایش انرژی و حذف سموم از بدن هستند.
    این رژیم مناسب نیست برای: افرادی که دارای مشکلات پزشکی خاص هستند یا به دنبال یک برنامه غذایی پایدار و طولانی‌مدت هستند.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 12,
  },
  {
    title: "رژیم استپ وزنی",
    text: `رژیم استپ وزنی یک برنامه غذایی است که به شما کمک می‌کند تا از توقف در کاهش وزن جلوگیری کنید و به تدریج به وزن دلخواه خود برسید. این رژیم شامل تغییرات مداوم در مقدار کالری مصرفی و نوع مواد غذایی است تا بدن شما به طور مداوم به چالش کشیده شود و متابولیسم آن بهینه بماند. با تمرکز بر روی تعادل در پروتئین‌ها، کربوهیدرات‌ها و چربی‌های سالم، این رژیم به شما این امکان را می‌دهد که در حین کاهش وزن، انرژی و سلامتی خود را حفظ کنید.

    با اجرای این رژیم، می‌توانید با لذت از غذاها و برنامه‌های غذایی متنوع بهره‌مند شوید و از احساس یکنواختی در رژیم خود دور بمانید.
    این رژیم برای: افرادی که از کاهش وزن در یک دوره زمانی خاص خسته شده‌اند و به دنبال راهی برای بازگشت به روند کاهش وزن هستند.
    این رژیم مناسب نیست برای: افرادی که به دنبال یک روش سریع برای کاهش وزن هستند یا نیاز به رژیم غذایی مشخص و ثابتی دارند.`,
    image: "/images/11663519_20944480.svg",
    id: 13,
  },
  {
    title: "رژیم افزایش وزن و حجم عضلانی",
    text: `رژیم افزایش وزن و حجم عضلانی به گونه‌ای طراحی شده است که به شما کمک می‌کند به طور سالم وزن اضافه کنید و عضلات خود را تقویت کنید. این رژیم شامل مصرف مواد غذایی غنی از کالری و پروتئین است، از جمله گوشت، ماهی، تخم‌مرغ، لبنیات و منابع گیاهی مانند حبوبات و مغزها. با تمرکز بر روی ترکیب صحیح کربوهیدرات‌ها و چربی‌های سالم، این رژیم نه تنها به افزایش وزن کمک می‌کند، بلکه به بهبود عملکرد ورزشی و بازسازی عضلات نیز می‌انجامد. با پیروی از این برنامه غذایی، می‌توانید به تدریج به هدف خود برسید و از نتایج قابل مشاهده و مثبتی در فیزیک بدنی‌تان برخوردار شوید.
    این رژیم برای: افرادی که دچار کمبود وزن هستند و به دنبال افزایش حجم عضلانی و بهبود عملکرد ورزشی خود می‌باشند.
    این رژیم مناسب نیست برای: افرادی که به دنبال کاهش وزن یا کنترل وزن خود هستند و یا کسانی که دارای مشکلات پزشکی مرتبط با چاقی هستند.`,
    image: "/images/7434479_3665593.svg",
    id: 14,
  },
  {
    title: "رژیم ارزان قیمت",
    text: `رژیم ارزان قیمت یک راهکار هوشمندانه برای حفظ سلامت و تندرستی بدون فشار مالی است. این رژیم شامل انتخاب مواد غذایی مغذی و مقرون به صرفه، مانند حبوبات، سبزیجات فصلی، غلات کامل و پروتئین‌های گیاهی می‌باشد. با تمرکز بر روی تهیه غذاهای خانگی و استفاده از ترکیبات ساده، می‌توانید به راحتی غذاهای خوشمزه و سالمی تهیه کنید که هزینه کمتری دارند. این رژیم به شما کمک می‌کند تا از مزایای تغذیه سالم بهره‌مند شوید و در عین حال به بودجه خود نیز احترام بگذارید.
    این رژیم برای: افرادی که به دنبال تغذیه سالم با هزینه کم هستند و می‌خواهند از مواد غذایی طبیعی و مغذی استفاده کنند.
    این رژیم مناسب نیست برای: افرادی که به دنبال رژیم‌های خاص یا برنامه‌های غذایی لوکس و گران‌قیمت هستند و نیاز به تنوع بالا در وعده‌های غذایی دارند.`,
    image: "/images/7942060_3794813.svg",
    id: 15,
  },
  {
    title: "رژیم غذایی که سریع آماده می‌شوند",
    text: `رژیم غذایی که سریع آماده می‌شود، یک راه حل عالی برای افرادی است که زمان کافی برای آشپزی ندارند اما همچنان می‌خواهند از تغذیه سالم بهره‌مند شوند. این رژیم شامل دستورهای غذایی ساده و سریع است که در کمتر از ۳۰ دقیقه آماده می‌شوند و شامل مواد غذایی مغذی مانند سبزیجات تازه، پروتئین‌های کم‌چرب و غلات کامل است. با استفاده از این برنامه غذایی، می‌توانید به راحتی وعده‌های غذایی خوشمزه و سالم تهیه کنید و از سلامتی و انرژی بیشتری برخوردار شوید، بدون اینکه زمان زیادی صرف کنید.
    این رژیم برای: افرادی که مشغله‌های روزمره دارند و به دنبال وعده‌های غذایی سریع و سالم هستند.
    این رژیم مناسب نیست برای: افرادی که به دنبال تجربه آشپزی پیچیده‌تر یا زمان بیشتری برای تهیه غذا دارند و به دنبال دستورهای غذایی خاص و زمان‌بر هستند.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 16,
  },
  {
    title: "رژیم سالم‌حفظ و تعادل وزن",
    text: `این رژیم مناسب افرادی است که به دنبال حفظ وزن ایده‌آل خود و جلوگیری از نوسانات وزن هستند. با تمرکز بر مصرف متعادل گروه‌های غذایی اصلی، این رژیم به شما کمک می‌کند نه تنها به وزن مطلوب برسید، بلکه آن را در طولانی‌مدت نگه دارید. همچنین از انرژی بدن شما پشتیبانی می‌کند و به حفظ سلامتی عمومی کمک می‌کند. این رژیم با انعطاف‌پذیری بالا و برنامه‌های غذایی ساده و مغذی، بهترین گزینه برای کسانی است که می‌خواهند به‌طور طبیعی و بدون سختی‌های زیاد به تعادل وزنی برسند.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال حفظ وزن ایده‌آل و جلوگیری از افزایش یا کاهش شدید وزن هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که نیاز به کاهش یا افزایش وزن شدید دارند، ممکن است بهتر باشد از رژیم‌های خاص‌تری استفاده کنند.`,
    image: "/images/8381144_3901686.svg",
    id: 17,
  },
  {
    title: "رژیم افزایش انرژی و عملکرد ورزشی",
    text: `اگر به دنبال بهبود عملکرد ورزشی خود هستید و می‌خواهید در طول روز انرژی بیشتری داشته باشید، این رژیم برای شما طراحی شده است. با ترکیبی از مواد مغذی ضروری و غذاهایی که سوخت بدن شما را بهینه می‌کنند، این رژیم کمک می‌کند تا با قدرت بیشتری ورزش کنید و سریع‌تر ریکاوری شوید. هدف این برنامه، افزایش توان بدنی و حفظ انرژی مداوم در طول تمرینات و فعالیت‌های روزمره است.
    این رژیم برای چه کسانی مناسب است؟ ورزشکاران، افراد فعال و کسانی که به دنبال افزایش انرژی و بهبود عملکرد ورزشی خود هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که نیاز به کاهش وزن سریع دارند یا تمرینات ورزشی سنگین انجام نمی‌دهند.`,
    image: "/images/2945081_28533.svg",
    id: 18,
  },
  {
    title: "رژیم بهبود سلامت عمومی و سیستم دفاعی",
    text: `این رژیم با هدف تقویت سیستم ایمنی بدن و بهبود سلامت عمومی طراحی شده است. سرشار از ویتامین‌ها، مواد معدنی و آنتی‌اکسیدان‌هاست که بدن شما را در برابر بیماری‌ها مقاوم‌تر می‌کند و به شما کمک می‌کند تا از انرژی و شادابی بیشتری برخوردار شوید. با مصرف غذاهای تازه و طبیعی، این رژیم نه‌تنها سیستم ایمنی شما را تقویت می‌کند بلکه به بهبود عملکرد روزمره بدن نیز کمک می‌کند.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال تقویت سیستم ایمنی، پیشگیری از بیماری‌ها و بهبود سلامت عمومی هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که نیاز به برنامه غذایی خاص برای کاهش وزن یا ورزش‌های سنگین دارند.`,
    image: "/images/7434479_3665593.svg",
    id: 19,
  },
  {
    title: "رژیم برای افراد پر مشغله و کارمندان",
    text: `این رژیم برای کسانی طراحی شده است که وقت کافی برای برنامه‌ریزی وعده‌های غذایی ندارند و به دنبال گزینه‌های سریع، مغذی و ساده هستند. با این رژیم، می‌توانید بدون نیاز به صرف زمان زیاد، از مواد غذایی سالم و انرژی‌بخش بهره ببرید و در طول روز بهره‌وری بیشتری داشته باشید. هدف این رژیم حفظ سلامتی و انرژی در طول ساعت‌های طولانی کار است.
    این رژیم برای چه کسانی مناسب است؟ کارمندان، افراد پرمشغله و کسانی که زمان کافی برای آماده‌سازی غذاهای پیچیده ندارند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که زمان و انگیزه کافی برای تهیه و پخت غذاهای خاص و مفصل دارند.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 20,
  },
  {
    title: "رژیم آمریکایی و کانادایی",
    text: `این رژیم با الهام از فرهنگ غذایی سالم و متنوع آمریکای شمالی طراحی شده است. ترکیبی از پروتئین‌های باکیفیت، غلات کامل، میوه‌ها و سبزیجات تازه به شما کمک می‌کند تا از تنوع غذایی لذت ببرید و در عین حال به وزن ایده‌آل و سلامتی پایدار دست پیدا کنید. این برنامه غذایی به‌گونه‌ای تنظیم شده که تمام نیازهای روزانه بدن را تأمین کند و به شما انرژی و نشاط بدهد.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال یک برنامه غذایی متعادل و غنی از مواد مغذی با الهام از غذاهای آمریکای شمالی هستند. چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که به رژیم‌های تخصصی مانند کتو یا وگان علاقه‌مند هستند، ممکن است گزینه‌های بهتری را انتخاب کنند.`,
    image: "/images/11663519_20944480.svg",
    id: 21,
  },
  {
    title: "رژیم پر پروتئین",
    text: `اگر به دنبال افزایش توده عضلانی، بهبود ریکاوری پس از تمرینات و سوزاندن چربی‌های اضافه هستید، رژیم پر پروتئین بهترین انتخاب برای شماست. این رژیم با تمرکز بر منابع پروتئینی باکیفیت مانند گوشت کم‌چرب، تخم‌مرغ، حبوبات و ماهی، به شما کمک می‌کند تا قدرت و استقامت بدن خود را تقویت کنید و در عین حال سوخت‌وساز بدن را بهبود ببخشید. با این رژیم، می‌توانید به اهداف تناسب اندام خود سریع‌تر دست یابید.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال افزایش عضله، ورزشکاران و کسانی که بهبود ریکاوری و عملکرد بدنی را هدف دارند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که دچار مشکلات کلیوی یا محدودیت‌های پروتئینی هستند، بهتر است این رژیم را انتخاب نکنند.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 22,
  },
  {
    title: "رژیم اتکینز ( کم کربوهیدرات)",
    text: `ژیم اتکینز به شما کمک می‌کند با کاهش مصرف کربوهیدرات‌ها و تمرکز بر مصرف پروتئین‌ها و چربی‌های سالم، به‌سرعت چربی‌های اضافه بدن را بسوزانید و وزن خود را کاهش دهید. این رژیم باعث می‌شود که بدن به‌جای کربوهیدرات‌ها، از چربی‌ها به‌عنوان منبع انرژی استفاده کند. با تنظیم قند خون و کنترل اشتها، این رژیم نه‌تنها به کاهش وزن کمک می‌کند بلکه انرژی مداومی را در طول روز فراهم می‌سازد.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال کاهش وزن سریع، کنترل قند خون و بهبود متابولیسم هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی با مشکلات کلیوی یا کسانی که نیاز به مصرف متعادل‌تر کربوهیدرات‌ها دارند، باید از این رژیم اجتناب کنند.`,
    image: "/images/7942060_3794813.svg",
    id: 23,
  },
  {
    title: "رژیم‌ کم چربی",
    text: `اگر به دنبال کاهش وزن و بهبود سلامت قلب خود هستید، رژیم کم چربی یکی از بهترین گزینه‌هاست. این رژیم با کاهش مصرف چربی‌های اشباع و تمرکز بر غذاهای کم‌چرب، به شما کمک می‌کند که چربی بدن را کاهش دهید و به وزن ایده‌آل خود برسید. همچنین با مصرف مواد غذایی سالم‌تر و مغذی‌تر مانند سبزیجات، میوه‌ها و غلات کامل، به تقویت سیستم ایمنی و سلامت کلی بدن کمک می‌کند.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال کاهش وزن، بهبود سلامت قلب و کاهش کلسترول هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ کسانی که نیاز به افزایش عضله یا مصرف چربی‌های سالم دارند، ممکن است به رژیم‌های دیگری نیاز داشته باشند.`,
    image: "/images/8381144_3901686.svg",
    id: 24,
  },
  {
    title: "رژیم زو‌م و دش ( Dash )، جهت فشار خون",
    text: `رژیم DASH (رویکردهای غذایی برای توقف فشار خون) یکی از سالم‌ترین برنامه‌های غذایی برای کنترل و کاهش فشار خون بالا است.

    این رژیم بر مصرف غذاهای سرشار از پتاسیم، کلسیم و منیزیم مانند میوه‌ها، سبزیجات و غلات کامل تمرکز دارد. هدف اصلی این رژیم، کاهش مصرف نمک و چربی‌های ناسالم است که به سلامت قلب و کاهش خطر بیماری‌های قلبی کمک می‌کند. با انتخاب این رژیم، نه‌تنها فشار خون خود را تنظیم می‌کنید، بلکه به وزن ایده‌آل نیز نزدیک‌تر می‌شوید.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال کنترل فشار خون، بهبود سلامت قلب و کاهش وزن هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که به مصرف غذاهای با کربوهیدرات پایین علاقه‌مند هستند یا نیازهای خاص غذایی دارند، ممکن است این رژیم برایشان مناسب نباشد.`,
    image: "/images/2945081_28533.svg",
    id: 25,
  },
  {
    title: "رژیم قلیایی",
    text: `رژیم قلیایی با هدف ایجاد تعادل در pH بدن و بهبود سلامت عمومی طراحی شده است. این رژیم بر مصرف غذاهای قلیایی مانند میوه‌ها، سبزیجات و دانه‌ها تأکید دارد و مصرف غذاهای اسیدی مانند گوشت قرمز، محصولات لبنی و شکر را کاهش می‌دهد. رژیم قلیایی به کاهش التهابات، بهبود سطح انرژی و ارتقاء سلامت پوست و گوارش کمک می‌کند. با دنبال کردن این رژیم، احساس سبکی و شادابی بیشتری خواهید داشت و بدن شما به‌طور طبیعی به تعادل می‌رسد.
    این رژیم برای چه کسانی مناسب است؟ افرادی که به دنبال بهبود سطح انرژی، کاهش التهابات و تقویت سلامت عمومی بدن هستند.
    چه کسانی نباید از این رژیم استفاده کنند؟ افرادی که نیاز به مصرف بالای پروتئین دارند یا به رژیم‌های خاص مانند کتو متعهد هستند، ممکن است این رژیم برایشان مناسب نباشد.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 26,
  },
  {
    title: "رژیم مایند ( Mind )",
    text: `ژیم مایند ترکیبی از رژیم مدیترانه‌ای و رژیم DASH است که برای بهبود سلامت مغز و کاهش خطر بیماری‌های عصبی، به‌ویژه آلزایمر، طراحی شده است. این رژیم بر مصرف غذاهایی همچون سبزیجات برگ‌دار، توت‌ها، مغزها و غلات کامل تأکید می‌کند و غذاهای ناسالم مانند غذاهای فرآوری‌شده و چرب را محدود می‌کند. انتخاب این رژیم نه تنها به سلامت بدن کمک می‌کند، بلکه ذهن شما را نیز تقویت می‌کند و حافظه و تمرکزتان را بهبود می‌بخشد.
    برای چه کسانی مناسب است؟ برای افرادی که به‌دنبال بهبود عملکرد مغزی و پیشگیری از مشکلات حافظه‌ای هستند، به‌ویژه در میانسالی و سنین بالاتر.
    برای چه کسانی مناسب نیست؟ برای کسانی که به رژیم‌های با چربی بسیار پایین یا غذاهای گیاهی مطلق علاقه‌مند نیستند.`,
    image: "/images/11663519_20944480.svg",
    id: 27,
  },
  {
    title: "رژیم دوکان‌ ( Dukan )",
    text: `رژیم دوکان یک برنامه غذایی پرپروتئین و کم‌کربوهیدرات است که به چهار مرحله تقسیم می‌شود: حمله، تثبیت، تقویت و نگهداری. این رژیم متکی بر مصرف پروتئین‌های بدون چربی، سبزیجات و مواد غذایی با شاخص گلیسمی پایین است. با رعایت این رژیم، نه‌تنها به کاهش وزن چشمگیر دست پیدا می‌کنید، بلکه می‌توانید وزن ایده‌آل خود را در طولانی‌مدت حفظ کنید. اگر به‌دنبال راهکاری سریع و مؤثر برای رسیدن به تناسب‌اندام هستید، رژیم دوکان می‌تواند انتخابی عالی باشد.
 
    برای چه کسانی مناسب است؟ برای افرادی که به دنبال کاهش وزن سریع و حفظ آن در طولانی‌مدت هستند و می‌توانند رژیمی با پروتئین بالا و کربوهیدرات پایین را دنبال کنند.
    برای چه کسانی مناسب نیست؟ برای افرادی با مشکلات کلیوی یا کبدی، و کسانی که به رژیم‌های غذایی متعادل‌تر با تنوع غذایی بیشتر علاقه دارند.`,
    image: "/images/7434479_3665593.svg",
    id: 28,
  },
  {
    title: "رژیم غذایی حجم سازی ( Bulking Diet )",
    text: `رژیم حجم‌سازی برای افرادی طراحی شده که به‌دنبال افزایش حجم عضلات و بهبود عملکرد ورزشی هستند. این رژیم بر مصرف پروتئین‌های باکیفیت، کربوهیدرات‌های پیچیده و چربی‌های سالم تمرکز دارد تا بدن را در فاز رشد و ریکاوری قرار دهد. با رعایت این رژیم، نه‌تنها عضلات خود را تقویت می‌کنید، بلکه انرژی و توان لازم برای تمرینات سنگین‌تر را نیز به دست می‌آورید. اگر هدف شما افزایش وزن و عضله‌سازی است، این رژیم راهی مؤثر برای رسیدن به آن خواهد بود.
    برای چه کسانی مناسب است؟ برای افرادی که به‌دنبال افزایش حجم عضلانی و بهبود توان بدنی هستند، به‌ویژه ورزشکاران و بدنسازان.
    برای چه کسانی مناسب نیست؟ برای کسانی که به‌دنبال کاهش وزن یا حفظ وزن فعلی خود هستند یا با محدودیت‌های سلامتی مانند مشکلات قلبی یا متابولیکی مواجهند.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 29,
  },
  {
    title: "رژیم غذایی کربوهیدرات چرخشی ( Carb Cycling )",
    text: `رژیم کربوهیدرات چرخشی یک استراتژی هوشمندانه برای تنظیم مصرف کربوهیدرات است که روزهای پرکربوهیدرات و کم‌کربوهیدرات را به‌طور متناوب برنامه‌ریزی می‌کند. این رژیم به شما امکان می‌دهد هم از انرژی کربوهیدرات‌ها در روزهای سنگین تمرین استفاده کنید و هم در روزهای استراحت، چربی‌سوزی را به حداکثر برسانید. اگر به‌دنبال افزایش عملکرد ورزشی، کاهش چربی و حفظ یا حتی افزایش حجم عضلات هستید، رژیم کربوهیدرات چرخشی بهترین انتخاب برای شما خواهد بود.
    برای چه کسانی مناسب است؟ برای ورزشکاران، بدنسازان و افرادی که به دنبال تنظیم وزن، چربی‌سوزی و حفظ عضلات خود هستند.
    
    برای چه کسانی مناسب نیست؟ برای کسانی که به رژیم‌های پایدارتر علاقه‌مندند یا افرادی که مشکلات قند خون یا حساسیت به تغییرات سریع کربوهیدرات دارند.`,
    image: "/images/7942060_3794813.svg",
    id: 30,
  },
  {
    title: "رژیم ضد التهاب",
    text: `رژیم ضد التهاب بر اساس مصرف مواد غذایی است که به کاهش التهاب در بدن کمک می‌کنند، مانند میوه‌ها، سبزیجات، ماهی‌های چرب و مغزها. این رژیم علاوه بر بهبود سلامت عمومی، به کاهش ریسک بیماری‌های مزمن مانند دیابت و بیماری‌های قلبی کمک می‌کند. اگر به دنبال یک رژیم سالم و پایدار هستید که علاوه بر تناسب اندام، سلامت درونی شما را نیز بهبود بخشد، این رژیم برای شما ایده‌آل خواهد بود.
    برای چه کسانی مناسب است؟ برای افرادی که به دنبال کاهش التهاب، بهبود سلامت عمومی و پیشگیری از بیماری‌های مزمن هستند.
    برای چه کسانی مناسب نیست؟ برای کسانی که به رژیم‌های پرپروتئین یا پرکالری علاقه‌مند هستند یا نیاز به افزایش سریع وزن دارند.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 31,
  },
  {
    title: "رژیم برای کاهش ریزش مو",
    text: `این رژیم با تمرکز بر مواد مغذی مورد نیاز برای سلامت موها، از جمله پروتئین‌ها، ویتامین‌ها و مواد معدنی همچون بیوتین، آهن و زینک طراحی شده است. مصرف مواد غذایی سرشار از این مواد مغذی مانند تخم‌مرغ، ماهی، مغزها و سبزیجات برگ‌دار، می‌تواند به تقویت ریشه مو و کاهش ریزش آن کمک کند. اگر به‌دنبال افزایش حجم و درخشندگی موهای خود هستید و می‌خواهید ریزش موها را کاهش دهید، این رژیم مناسب شماست.
    برای چه کسانی مناسب است؟ برای افرادی که دچار ریزش مو یا ضعف در موهای خود هستند و به‌دنبال بهبود سلامت موهایشان هستند.
    برای چه کسانی مناسب نیست؟ برای کسانی که به دنبال کاهش وزن سریع هستند یا رژیم‌های خاص با تمرکز بر چربی‌سوزی دارند.`,
    image: "/images/8381144_3901686.svg",
    id: 32,
  },
  {
    title: "رژیم جهت پوست مناسب",
    text: `رژیم غذایی برای بهبود پوست: این رژیم بر اساس مصرف مواد غذایی غنی از آنتی‌اکسیدان‌ها، ویتامین C، E و اسیدهای چرب امگا 3 طراحی شده است که به تقویت پوست، افزایش رطوبت و کاهش علائم پیری کمک می‌کنند. مواد غذایی مانند آووکادو، ماهی سالمون، توت‌ها و سبزیجات برگ‌دار در این رژیم نقش مهمی دارند و باعث درخشندگی و شفافیت پوست می‌شوند. اگر به‌دنبال پوستی سالم، درخشان و بدون التهاب هستید، این رژیم می‌تواند به شما کمک کند.
    برای چه کسانی مناسب است؟ برای افرادی که به‌دنبال بهبود سلامت و زیبایی پوست خود هستند و می‌خواهند با تغذیه مناسب، شادابی پوستشان را افزایش دهند.
    برای چه کسانی مناسب نیست؟ برای کسانی که به دنبال کاهش وزن سریع یا رژیم‌های پرپروتئین هستند.`,
    image: "/images/11663519_20944480.svg",
    id: 33,
  },
  {
    title: "رژیم‌ برای کاهش کلسترول",
    text: `این رژیم بر اساس مصرف غذاهایی که به کاهش کلسترول بد (LDL) و افزایش کلسترول خوب (HDL) کمک می‌کنند، طراحی شده است. مواد غذایی مانند جو دوسر، مغزها، ماهی‌های چرب، روغن زیتون و میوه‌هایی مانند سیب و آووکادو به بهبود سلامت قلب و کاهش کلسترول خون کمک می‌کنند. اگر به دنبال بهبود سلامت قلبی و کاهش سطح کلسترول خود هستید، این رژیم بهترین انتخاب برای شما خواهد بود.
    برای چه کسانی مناسب است؟ برای افرادی که سطح کلسترول بالایی دارند و به دنبال کاهش خطر بیماری‌های قلبی هستند.
    برای چه کسانی مناسب نیست؟ برای کسانی که به دنبال افزایش وزن سریع یا رژیم‌های با پروتئین بالا و چربی کم هستند.`,
    image: "/images/2945081_28533.svg",
    id: 34,
  },
  {
    title: "رژیم برای مقاومت به انسولین",
    text: `این رژیم با تمرکز بر کنترل سطح قند خون و بهبود حساسیت به انسولین طراحی شده است. مصرف کربوهیدرات‌های پیچیده، پروتئین‌های بدون چربی و چربی‌های سالم مانند ماهی، مغزها و سبزیجات باعث می‌شود سطح قند خون در محدوده نرمال باقی بماند و از نوسانات شدید جلوگیری شود. این رژیم برای افرادی که با مشکل مقاومت به انسولین مواجه هستند، گزینه‌ای عالی است تا علاوه بر تنظیم قند خون، انرژی لازم برای بدن خود را تأمین کنند.
    برای چه کسانی مناسب است؟ برای افرادی که دچار مقاومت به انسولین یا دیابت نوع ۲ هستند و به دنبال بهبود سطح قند خون خود می‌باشند.
    برای چه کسانی مناسب نیست؟ برای کسانی که نیاز به رژیم‌های پرکالری یا پرکربوهیدرات برای افزایش وزن سریع دارند.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 35,
  },
  {
    title: "رژیم دیابت",
    text: `این رژیم برای کمک به کنترل سطح قند خون و پیشگیری از نوسانات شدید آن طراحی شده است. با مصرف غذاهای سرشار از فیبر، پروتئین‌های بدون چربی و کربوهیدرات‌های پیچیده مانند سبزیجات، غلات کامل و حبوبات، این رژیم به شما کمک می‌کند تا سطح قند خون خود را متعادل نگه دارید. اگر به‌دنبال یک روش سالم و مؤثر برای مدیریت دیابت و بهبود کیفیت زندگی خود هستید، این رژیم می‌تواند انتخابی عالی باشد.
    برای چه کسانی مناسب است؟ برای افراد مبتلا به دیابت نوع ۱ و ۲ یا کسانی که در معرض ابتلا به دیابت هستند و به‌دنبال کنترل بهتر سطح قند خون خود هستند.
    برای چه کسانی مناسب نیست؟ برای کسانی که به دنبال رژیم‌های پرکالری یا پرکربوهیدرات برای افزایش وزن یا انرژی سریع هستند.`,
    image: "/images/7434479_3665593.svg",
    id: 36,
  },
  {
    title: "رژیم برای افراد مشکل قلبی",
    text: `این رژیم غذایی به‌طور ویژه برای کسانی طراحی شده است که نیاز به مراقبت بیشتر از سلامت قلب خود دارند. با ترکیب مواد غذایی کم‌چرب، کم‌نمک و غنی از آنتی‌اکسیدان‌ها، این رژیم به کاهش کلسترول و فشار خون کمک می‌کند و باعث بهبود سلامت کلی قلب می‌شود. این یک برنامه غذایی است که هم شما را سیر نگه می‌دارد و هم قلبتان را سالم‌تر می‌کند.
    این رژیم مناسب است برای: افرادی با سابقه مشکلات قلبی، فشار خون بالا، یا سطح کلسترول بالا.
    این رژیم مناسب نیست برای: افرادی که نیاز به رژیم‌های پرکالری دارند یا افرادی با بیماری‌های کلیوی پیشرفته.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 37,
  },
  {
    title: "رژیم غذایی کم سدیم",
    text: `رژیم کم سدیم برای کسانی که به دنبال کنترل فشار خون و بهبود سلامت کلی هستند، ایده‌آل است. با مصرف کمتر نمک و جایگزینی آن با ادویه‌ها و مواد غذایی تازه، این رژیم به کاهش تورم، حفظ سلامت قلب و کلیه‌ها کمک می‌کند. از غذاهای لذیذ لذت ببرید، بدون اینکه نگران تأثیرات منفی نمک باشید!
    این رژیم مناسب است برای: افرادی با فشار خون بالا، مشکلات کلیوی، یا کسانی که به دنبال بهبود سلامت قلب خود هستند.
    این رژیم مناسب نیست برای: افرادی که به دلیل شرایط پزشکی نیاز به مصرف بیشتر سدیم دارند، مانند ورزشکاران شدیداً فعال.`,
    image: "/images/7942060_3794813.svg",
    id: 38,
  },
  {
    title: "رژیم برای کودکان",
    text: `این رژیم غذایی مخصوص کودکان به گونه‌ای طراحی شده که نیازهای رشد، انرژی و تغذیه کودک را تأمین کند. با ترکیب غذاهای خوشمزه و مغذی که سرشار از ویتامین‌ها و مواد معدنی ضروری هستند، این رژیم به تقویت سیستم ایمنی، بهبود تمرکز و حفظ وزن سالم کمک می‌کند. بدون نگرانی از تغذیه کودک خود، او را با طعم‌های متنوع آشنا کنید!
    این رژیم مناسب است برای: کودکان در سنین رشد که نیاز به تغذیه متعادل و انرژی مناسب برای فعالیت‌های روزانه دارند.
    این رژیم مناسب نیست برای: کودکان با حساسیت‌های غذایی خاص یا نیازهای تغذیه‌ای ویژه مانند بیماری‌های متابولیک.`,
    image: "/images/11663519_20944480.svg",
    id: 39,
  },
  {
    title: "رژیم برای نوجوانان",
    text: `ین رژیم غذایی برای نوجوانانی طراحی شده که در مرحله مهم رشد جسمی و ذهنی هستند. با ارائه غذاهای متعادل و پرانرژی، این رژیم به تقویت عضلات، بهبود تمرکز و حفظ وزن سالم کمک می‌کند. مواد مغذی موجود در این برنامه به نوجوانان قدرت می‌دهد تا بهترین نسخه از خودشان باشند و به رشد سالم‌تری دست یابند.
    این رژیم مناسب است برای: نوجوانانی که در حال رشد سریع هستند و به تغذیه متعادل برای حمایت از فعالیت‌های روزمره و تحصیل نیاز دارند.
    این رژیم مناسب نیست برای: نوجوانانی که مشکلات پزشکی خاص یا نیازهای تغذیه‌ای ویژه دارند، مانند آلرژی‌های شدید یا بیماری‌های متابولیک.`,
    image: "/images/8381144_3901686.svg",
    id: 40,
  },
  {
    title: "رژیم کم نمک",
    text: `این رژیم کم‌ نمک به شما کمک می‌کند تا با کاهش مصرف سدیم، فشار خون خود را کنترل کرده و سلامت قلب و کلیه‌هایتان را بهبود ببخشید. با جایگزینی نمک با ادویه‌های طبیعی و گیاهان معطر، همچنان می‌توانید از طعم‌های جذاب و غذاهای لذیذ لذت ببرید و در عین حال از مشکلات مرتبط با نمک بالا جلوگیری کنید.
    این رژیم مناسب است برای: افرادی که به دنبال کاهش فشار خون، بهبود سلامت قلب و کاهش خطر سکته هستند.
    این رژیم مناسب نیست برای: افرادی که نیاز به سدیم بیشتر دارند، مانند ورزشکاران حرفه‌ای یا کسانی که به تعریق زیاد دچار می‌شوند.`,
    image: "/images/2945081_28533.svg",
    id: 41,
  },
  {
    title: "رژیم برای سالمندان",
    text: `این رژیم غذایی به‌طور خاص برای سالمندان طراحی شده است تا نیازهای تغذیه‌ای ویژه آنها را تأمین کند. با تمرکز بر مواد غذایی غنی از فیبر، کلسیم، ویتامین D و آنتی‌اکسیدان‌ها، این رژیم به بهبود سلامت استخوان‌ها، افزایش انرژی و تقویت سیستم ایمنی کمک می‌کند. بدون سختی، تغذیه سالم‌تری داشته باشید و از زندگی فعال لذت ببرید!
    این رژیم مناسب است برای: سالمندانی که به دنبال حفظ سلامت استخوان‌ها، بهبود عملکرد بدن و افزایش سطح انرژی هستند.
    این رژیم مناسب نیست برای: افرادی با بیماری‌های خاصی که نیاز به محدودیت‌های غذایی ویژه دارند، مانند بیماری‌های کلیوی شدید.`,
    image: "/images/15128913_ODcyMjQ5OTkx.jpg",
    id: 42,
  },
  {
    title: "رژیم برای سلامت روان",
    text: `این رژیم غذایی به‌طور ویژه طراحی شده است تا با ترکیب مواد غذایی غنی از امگا-3، ویتامین‌های گروه B، آنتی‌اکسیدان‌ها و پروتئین‌های سالم، به بهبود سلامت روان و افزایش سطح انرژی کمک کند. این برنامه غذایی بر پایه مواد مغذی است که به تقویت مغز، کاهش استرس و بهبود خلق‌وخو کمک می‌کند، و به شما امکان می‌دهد تا ذهنی آرام‌تر و شاداب‌تر داشته باشید.
    این رژیم مناسب است برای: افرادی که به دنبال کاهش استرس، بهبود خلق‌وخو و افزایش تمرکز و سلامت روانی هستند.
    این رژیم مناسب نیست برای: افرادی با نیازهای تغذیه‌ای بسیار خاص یا بیماری‌های روانی که نیاز به درمان دارویی و تخصصی دارند.`,
    image: "/images/12145582_Wavy_Edu-02_Single-11.svg",
    id: 43,
  },
  {
    title: "رژیم سوپ چربی سوز",
    text: ``,
    image: "/images/7434479_3665593.svg",
    id: 44,
  },
];

export { diets };
